INSERT INTO category (id, name, parent_id)
VALUES
('07d613cf-c93f-44c1-b761-254b97fbe439', 'Электроника', NULL),
('0a0a8afd-68bc-4826-b09b-416831f10329', 'Компьютеры',  NULL),
('0e531cc0-8481-46f0-95f1-be1f63dd7cd4', 'Гаджеты',     NULL),
('dcab9697-44d3-45f9-883d-db0fcf8eb44d', 'Для дома',    NULL);

INSERT INTO category (id, name, parent_id) VALUES
('ea25ed16-f817-48ed-a940-f784e523c051', 'Аудио',                '07d613cf-c93f-44c1-b761-254b97fbe439'),
('d1ea17ab-ec99-4b1c-9342-b4747ca24749', 'Наушники',             'ea25ed16-f817-48ed-a940-f784e523c051'),
('6e10c5b4-cb5e-4867-9215-bae3515897db', 'Колонки',              'ea25ed16-f817-48ed-a940-f784e523c051'),
('f63ee72b-51a3-44b1-8c56-89b9499f4fce', 'Видео',                '07d613cf-c93f-44c1-b761-254b97fbe439'),
('9a4ea9f2-8f05-47e2-bf07-deb5552bc706', 'Видеорегистраторы',    'f63ee72b-51a3-44b1-8c56-89b9499f4fce'),
('0f24a67b-d7e0-4f32-9fab-629a2e604ccd', 'Сетевое оборудование', '07d613cf-c93f-44c1-b761-254b97fbe439'),
('fd8f5210-4c4c-4f75-a19b-b5d6df6074e3', 'Роутеры',              '0f24a67b-d7e0-4f32-9fab-629a2e604ccd'),
('52c6d87b-7507-4faf-9bd8-5d16c0de9c8a', 'Микрофоны',            '07d613cf-c93f-44c1-b761-254b97fbe439'),
('b9e00a70-5e8f-461b-88bb-0ce474c236cd', 'Зарядные устройства',  '07d613cf-c93f-44c1-b761-254b97fbe439'),
('e210dabb-79f5-40f5-a337-4434dde87f8c', 'Мониторы',             '0a0a8afd-68bc-4826-b09b-416831f10329'),
('d36db488-800d-4209-a8e9-7c658da19101', 'Клавиатуры',           '0a0a8afd-68bc-4826-b09b-416831f10329'),
('93bfaf89-040e-44f3-a294-a6e90d753acf', 'Мыши',                 '0a0a8afd-68bc-4826-b09b-416831f10329'),
('b68eba94-f778-4be6-bff9-0c807df3ade2', 'Аксессуары',           '0a0a8afd-68bc-4826-b09b-416831f10329'),
('6055ce56-adac-4810-99a0-423bbe849a85', 'Коврики',              'b68eba94-f778-4be6-bff9-0c807df3ade2'),
('01d23cf7-a0bf-4c5e-a841-2a8c88f002ad', 'USB-хабы',             'b68eba94-f778-4be6-bff9-0c807df3ade2'),
('97796da2-eac6-4249-a40b-f748fe0f85a7', 'Накопители',           '0a0a8afd-68bc-4826-b09b-416831f10329'),
('905d0508-d95b-421e-adb6-d53b996d36ee', 'Умные часы',           '0e531cc0-8481-46f0-95f1-be1f63dd7cd4'),
('42239c4b-910a-408d-bce5-e888550a27af', 'Зарядки',              '0e531cc0-8481-46f0-95f1-be1f63dd7cd4'),
('4da8563d-75de-4e3e-bab4-b444e0493e5e', 'Bluetooth-адаптеры',   '0e531cc0-8481-46f0-95f1-be1f63dd7cd4'),
('e960bc55-bfe7-49ea-9cc6-887a97eec65c', 'Умные лампы',          'dcab9697-44d3-45f9-883d-db0fcf8eb44d'),
('741b3599-94f0-4038-997a-4581c03bca68', 'Умные розетки',        'dcab9697-44d3-45f9-883d-db0fcf8eb44d'),
('f0a57e92-56f4-4b1b-ae4c-c21ec5d97eda', 'Роботы-пылесосы',      'dcab9697-44d3-45f9-883d-db0fcf8eb44d');
