INSERT INTO warehouse (id, name, location, latitude, longitude, is_active, created_at) VALUES
('3fa85f64-5717-4562-b3fc-2c963f66afa6', 'Склад Север',     'Москва, Россия',       55.8765, 37.6531, true, '2025-05-20 16:26:22.452302 +00:00'),
('1c6e13f1-77e4-4a95-b0b0-bb24a8f3d946', 'Склад Юг',        'Сочи, Россия',         43.6028, 39.7342, true, '2025-05-20 16:26:22.452302 +00:00'),
('a7d0c429-8ee6-41cb-9f5d-bc6d8a0e8c35', 'Склад Центр',     'Казань, Россия',       55.7963, 49.1088, true, '2025-05-20 16:26:22.452302 +00:00'),
('c4b2e98f-64ff-45a7-88a6-7bb462ce6b89', 'Склад Урал',      'Екатеринбург, Россия', 56.8389, 60.6057, true, '2025-05-20 16:26:22.452302 +00:00'),
('38b8be26-b7e5-49b3-a86d-2bb4f9f4df12', 'Склад Запад',     'Калининград, Россия',  54.7104, 20.4522, false, '2025-05-20 16:26:22.452302 +00:00'),
('bd99f75c-6f13-4eb3-8a4e-b8f1f8deea72', 'Склад Восток',    'Владивосток, Россия',  43.1155, 131.8855, true, '2025-05-20 16:26:22.452302 +00:00'),
('e1a9d9ef-3b70-465f-82fc-4c1fcab2639b', 'Склад Поволжье',  'Самара, Россия',       53.1959, 50.1008, false, '2025-05-20 16:26:22.452302 +00:00');
